# RoomsCreatedAutomatically Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomsCreatedAutomatically Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] [Room] created automatically.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomsCreatedAutomatically { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomsCreatedAutomatically As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomsCreatedAutomatically {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace